Table of Contents
 Enum FatigueTypeOfPrestressingSteel
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Posttensioned reinforcement type
public enum FatigueTypeOfPrestressingSteel
Fields
ExternalTendon = 5
Table 6.4N: Parameters for S-N curves of prestressing steel - special type
PostTensioningCurvedTendonsInSteelDucts = 2
Table 6.4N: Parameters for S-N curves of prestressing steel - row 4
PostTensioningSingleStrandsInPlasticDucts = 0
Table 6.4N: Parameters for S-N curves of prestressing steel - row 2
PostTensioningSplicingDevices = 3
Table 6.4N: Parameters for S-N curves of prestressing steel - row 5
PostTensioningStraightTendonsOrCurvedTendonsInPlasticDucts = 1
Table 6.4N: Parameters for S-N curves of prestressing steel - row 3
PreTensioning = 4
Table 6.4N: Parameters for S-N curves of prestressing steel - row 1
Fields
 Name |  Description
 ExternalTendon = 5
Table 6.4N: Parameters for S-N curves of prestressing steel - special type
 PostTensioningCurvedTendonsInSteelDucts = 2
Table 6.4N: Parameters for S-N curves of prestressing steel - row 4
 PostTensioningSingleStrandsInPlasticDucts = 0
Table 6.4N: Parameters for S-N curves of prestressing steel - row 2
 PostTensioningSplicingDevices = 3
Table 6.4N: Parameters for S-N curves of prestressing steel - row 5
 PostTensioningStraightTendonsOrCurvedTendonsInPlasticDucts = 1
Table 6.4N: Parameters for S-N curves of prestressing steel - row 3
 PreTensioning = 4
Table 6.4N: Parameters for S-N curves of prestressing steel - row 1
 Edit this page